# Assignment 2 - Working with Pandas

 # Import Pandas

In [4]:
import pandas as pd

# 1. Creating the DataFrame
*  explanation:
In this step, we import the pandas library and create a simple DataFrame using a Python dictionary. This dataset includes names, ages, departments, and salaries of employees.

In [5]:


# Define data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
    'Salary': [45000, 54000, 50000, 62000, 47000]
}

# Create DataFrame
df = pd.DataFrame(data)

# Display the full DataFrame
df

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

# 1a. Display the First Five Rows
* Explanation:
This uses the head() function to view the first few records of the DataFrame. It‚Äôs useful for quickly inspecting your dataset.

In [6]:
df.head()

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

# 1b. Get Summary Statistics for Age and Salary
* Explanation:
We use the describe() method to get statistical summaries like count, mean, min, max, and standard deviation for numeric columns.

In [8]:
df[['Age','Salary']].describe()

             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

# 1c. Calculate Average Salary of HR Employees
* Explanation:
Here, we filter rows where the Department is 'HR', then compute the average of the Salary column.

In [9]:
hr_avg_salary = df[df["Department"]=='HR']['Salary'].mean()
print(f'So teh average salary of HR Department is :',hr_avg_salary)

So teh average salary of HR Department is : 46000.0

# 2. Add a New Column 'Bonus'
* üìù Explanation:
We create a new column called Bonus that is 10% of each employee's salary. This demonstrates how to perform column-wise operations in pandas.

In [14]:
df['Bonus'] = df['Salary'] * 0.10
df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

# 3. Filter the DataFrame to show employees aged between 25 and 30.  
*  Explanation:
This filters the DataFrame to show only those employees whose age is between 25 and 30 (inclusive). Logical conditions are used with & to combine filters.

In [17]:
age_filtered_df = df[(df['Age'] >= 25) & (df['Age'] <= 30)]
age_filtered_df

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

# 4. Group by Department and Calculate Average Salary
* Explanation:
Grouping data by a categorical column like Department allows us to aggregate numerical data. Here, we calculate the average salary per department.

In [19]:
department_Avg_salry = df.groupby('Department')['Salary'].mean()
department_Avg_salry

Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

# 5. Sort by Salary and Export to CSV
* Explanation:
We sort the DataFrame in ascending order based on Salary. Then, we export the sorted data to a CSV file using to_csv() for external use.

In [20]:
# Sort by salary in ascending order
sorted_df = df.sort_values(by='Salary', ascending=True)

# Save the sorted DataFrame to a CSV file
sorted_df.to_csv('sorted_employees.csv', index=False)

# Show the sorted DataFrame
sorted_df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0